let TargetFileNames = dynamic(["FILE_NAME_1",
    "FILE_NAME_2",
    "FILE_NAME_3"]);
let TargetDevice = "Device_Name_Here";
union DeviceNetworkEvents, DeviceProcessEvents, DeviceFileEvents, DeviceEvents, DeviceRegistryEvents
| where DeviceName contains TargetDevice
| where InitiatingProcessFileName has_any (TargetFileNames)
    or FileName has_any (TargetFileNames)
| project Timestamp, DeviceName, InitiatingProcessAccountName, ActionType, FileName, FolderPath, LocalIP, LocalPort, RemoteUrl, RemoteIP, RemotePort, SHA256, InitiatingProcessFileName, InitiatingProcessSHA256, InitiatingProcessCommandLine, RegistryKey, RegistryValueType, RegistryValueName, RegistryValueData, PreviousRegistryKey, PreviousRegistryValueName, PreviousRegistryValueData
