let TargetProcess = "FILE_NAME_HERE";
union DeviceNetworkEvents, DeviceProcessEvents, DeviceFileEvents, DeviceEvents, DeviceRegistryEvents
| where InitiatingProcessFileName startswith TargetFileName 
    or FileName startswith TargetFileName 
| project Timestamp, DeviceName, InitiatingProcessAccountName, ActionType, FileName, FolderPath, LocalIP, LocalPort, RemoteUrl, RemoteIP, RemotePort, SHA256, InitiatingProcessFileName, InitiatingProcessSHA256, InitiatingProcessCommandLine, RegistryKey, RegistryValueType, RegistryValueName, RegistryValueData, PreviousRegistryKey, PreviousRegistryValueName, PreviousRegistryValueData
